from pprint import pprint

s = '''У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.'''

words = s.lower().split()

for i in range(len(words)):
    words[i] = words[i].strip('.,:;!?…—')

for _ in range(words.count('')):
    words.remove('')

print(f"Количество слов: {len(words)}")

words_rates = []
for word in words:
    words_rates += [ (word, words.count(word)) ]

words_rates.sort(key=lambda x: x[1], reverse=True)
print(f"Самое частое слово: '{words_rates[0][0]}', встретилось {words_rates[0][1]} раз")
